# Brewfile - Homebrew dependencies management
# Usage: brew bundle install

# Taps
tap "atlassian/acli"
tap "coursier/formulas"
tap "dbt-labs/dbt"
tap "flyteorg/tap"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "scalacenter/bloop"
tap "spotify/public"
tap "spotify/sptaps"

# Core Development Tools
brew "git"
brew "gh"
brew "curl"
brew "jq"
brew "just"

# Terminal & Shell
brew "bash"
brew "bash-completion@2"
brew "tmux"
brew "starship"
brew "autoenv"
brew "lazygit"
brew "zellij"

# Text Editors
brew "neovim"
brew "helix"
brew "glow"

# Search & File Management
brew "ripgrep"
brew "bat"
brew "fd"
brew "the_silver_searcher"

# Languages & Runtimes
brew "go"
brew "node"
brew "nvm"
brew "python@3.13"
brew "python@3.12"
brew "python@3.11"
brew "python@3.10"
brew "python@3.9"
brew "python@3.8"
brew "rust"
brew "lua"
brew "luajit"

# Language Tools
brew "pyenv"
brew "pipx"
brew "tox"
brew "uv"
brew "yarn"
brew "luarocks"
brew "lua-language-server"
brew "tree-sitter"

# Java & Scala
brew "openjdk"
brew "openjdk@21"
brew "openjdk@11"
brew "scala"
brew "sbt"
brew "maven"
brew "coursier"
brew "bloop"
brew "scio"

# Cloud & Infrastructure
brew "awscli"
brew "kubectl-site"
brew "kubernetes-cli"
brew "kubectx"
brew "kubeconform"
brew "docker"
brew "docker-credential-helper"
brew "flytectl"

# Database Tools
brew "mysql-client"
brew "postgresql@14"
brew "sqlite"

# Spotify Internal Tools
brew "acli"
brew "avro-tools"
brew "data-endpoints-cli"
brew "gcs-avro-tools"
brew "gcs-magnolify-tools"
brew "gcs-parquet-cli"
brew "gcs-proto-tools"
brew "go-parquet-tools"
brew "grpcurl"
brew "hades-cli"
brew "hmtools"
brew "honk-cli"
brew "parquet-cli"
brew "protoman"
brew "spotify-disco"
brew "spgrpcurl"
brew "spuric"
brew "styx-cli"

# Protocol & Serialization
brew "protobuf"
brew "msgpack"

# Build Tools & Libraries
brew "autoconf"
brew "automake"
brew "libtool"
brew "m4"
brew "pkgconf"

# Compression
brew "brotli"
brew "lz4"
brew "lzo"
brew "snappy"
brew "xz"
brew "zlib"
brew "zstd"

# System Libraries
brew "abseil"
brew "c-ares"
brew "ca-certificates"
brew "cairo"
brew "cffi"
brew "cryptography"
brew "fontconfig"
brew "freetype"
brew "gdbm"
brew "gettext"
brew "giflib"
brew "glib"
brew "graphite2"
brew "harfbuzz"
brew "icu4c@77"
brew "icu4c@76"
brew "jpeg-turbo"
brew "krb5"
brew "libcbor"
brew "libevent"
brew "libfido2"
brew "libgit2"
brew "libgit2@1.8"
brew "libnghttp2"
brew "libnghttp3"
brew "libngtcp2"
brew "libpng"
brew "libpthread-stubs"
brew "libssh2"
brew "libtiff"
brew "libtommath"
brew "libunistring"
brew "libuv"
brew "libvterm"
brew "libx11"
brew "libxau"
brew "libxcb"
brew "libxdmcp"
brew "libxext"
brew "libxrender"
brew "little-cms2"
brew "llvm"
brew "lpeg"
brew "luv"
brew "mpdecimal"
brew "ncurses"
brew "oniguruma"
brew "openssl@3"
brew "openssl@1.1"
brew "pcre"
brew "pcre2"
brew "pixman"
brew "pycparser"
brew "python-packaging"
brew "readline"
brew "rtmpdump"
brew "six"
brew "tcl-tk"
brew "unibilium"
brew "utf8proc"
brew "xorgproto"
brew "z3"

# Casks (GUI Applications)
cask "alacritty"
cask "amethyst"
cask "corretto@11"
cask "corretto@8"
cask "font-hack-nerd-font"
cask "google-cloud-sdk"
cask "hammerspoon"